Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 881, 16)           192       
_________________________________________________________________
batch_normalization (BatchNo (None, 881, 16)           64        
_________________________________________________________________
activation (Activation)      (None, 881, 16)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 881, 16)           2832      
_________________________________________________________________
batch_normalization_1 (Batch (None, 881, 16)           64        
_________________________________________________________________
activation_1 (Activation)    (None, 881, 16)           0         
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 441, 16)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 441, 32)           5664      
_________________________________________________________________
batch_normalization_2 (Batch (None, 441, 32)           128       
_________________________________________________________________
activation_2 (Activation)    (None, 441, 32)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 441, 32)           11296     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 221, 32)           0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 221, 32)           128       
_________________________________________________________________
activation_3 (Activation)    (None, 221, 32)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 221, 64)           22592     
_________________________________________________________________
batch_normalization_4 (Batch (None, 221, 64)           256       
_________________________________________________________________
activation_4 (Activation)    (None, 221, 64)           0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 111, 64)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 111, 64)           45120     
_________________________________________________________________
batch_normalization_5 (Batch (None, 111, 64)           256       
_________________________________________________________________
activation_5 (Activation)    (None, 111, 64)           0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 56, 64)            0         
_________________________________________________________________
flatten (Flatten)            (None, 3584)              0         
_________________________________________________________________
dense (Dense)                (None, 1024)              3671040   
_________________________________________________________________
batch_normalization_6 (Batch (None, 1024)              4096      
_________________________________________________________________
activation_6 (Activation)    (None, 1024)              0         
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 2048)              2099200   
_________________________________________________________________
batch_normalization_7 (Batch (None, 2048)              8192      
_________________________________________________________________
activation_7 (Activation)    (None, 2048)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              8392704   
_________________________________________________________________
batch_normalization_8 (Batch (None, 4096)              16384     
_________________________________________________________________
activation_8 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_9 (Batch (None, 2048)              8192      
_________________________________________________________________
activation_9 (Activation)    (None, 2048)              0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1024)              2098176   
_________________________________________________________________
batch_normalization_10 (Batc (None, 1024)              4096      
_________________________________________________________________
activation_10 (Activation)   (None, 1024)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 512)               524800    
_________________________________________________________________
batch_normalization_11 (Batc (None, 512)               2048      
_________________________________________________________________
activation_11 (Activation)   (None, 512)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 256)               131328    
_________________________________________________________________
batch_normalization_12 (Batc (None, 256)               1024      
_________________________________________________________________
activation_12 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 2)                 514       
=================================================================
Total params: 25,441,042
Trainable params: 25,418,578
Non-trainable params: 22,464
_________________________________________________________________